public class Main {
    public static void main(String[] args) {
        String encryptedText = "ЛЯМЯР АЯЯСЪПГЪМ ЙЯМЪЙДИВД УИКОМУЧУ\n" +
                "\n" +
                "Япърсямъм, Цтаяй ёңк ёупуө\n" +
                "Яяжвямя ьлдр, лңк ёупуө,\n" +
                "Ярсъмгявъ Йойякя\n" +
                "Аярйям ёдпз аъпйъпяө,\n" +
                "Тцйям йтчсяи гъпйъпяө,\n" +
                "Йъжък йъкъц Жткөтйңп,\n" +
                "Йъмяи адквд зкзөсзп,\n" +
                "Йямгяиъм аяийяө йоплоййо,\n" +
                "Йяипяссттртм азклдййд\n" +
                "Йдн Атйяпвя йдкзөсзп.\n" +
                "\n" +
                "Йясъпя ёупуө ёңк цякъө,\n" +
                "Йямця аяясъп йңчцт якъө,\n" +
                "Ңпгңктт Атйяп чяяпъмя\n" +
                "Ясъмъм ңңжтм атпгт ьлз,\n" +
                "Яйаяксямъм ьп Цтаяй\n" +
                "Якърсям аяийяө стпгт ьлз.\n" +
                "\n" +
                "Аттптвтө йдквдм Цтаяйсъ\n" +
                "Атйяпгъй йопуө йдө яисяс,\n" +
                "Йдө яисйямгя мдмз яисяс;\n" +
                "\n" +
                "„Ьнйдисзө өдмгд яквъръж,\n" +
                "Ьц йзл цъгяө аяпвъръж,\n" +
                "Йой сдлзпгдм сңм йзивдм,\n" +
                "Йойякя ръмгтт яс лзмвдм,\n" +
                "Йяпяря ётпой аңкй ьсдс,\n" +
                "Йяяп адсзмд яикямвям,\n" +
                "\n" +
                "Ёңктл уигои цңэмаяч\n" +
                "Азп ёявъмя аяикямвям,\n" +
                "Яц яийъпъй, йтт рупоом,\n" +
                "Якднвзп ёяя, ръп ёдад,\n" +
                "Яисйямъмя йомаорой,\n" +
                "Яжъп рякяс янвдлд,\n" +
                "Ңнтпянгяө йңк рякря,\n" +
                "Ңпсң ёдпгдм ңпвтгяи,\n" +
                "Ңм ьйз йяөйя Атйяпгъ,\n" +
                "Ңикңө стпрял, тчтк чдп\n" +
                "Суй цъвяпаяи рңпвтгяи&quot;.\n" +
                "\n" +
                "Атк йяаяпгъ тййямгя,\n" +
                "Ёякөъ Атйяп цяиөякъө,\n" +
                "Совукуө йдсд ёяжгягъ.\n" +
                "Йяяпгъ Цтаяй аячсягъ.\n" +
                "Ётпс цтпйтпяө стпвямгя,\n" +
                "Цттвя йткяй стмвямгя,\n" +
                "Ңм ьйз йъжгъм йдмёдрз,\n" +
                "Йтгяигъм руивом өдмгдрз,\n" +
                "Йяпя ртпгтм рткттрт,\n" +
                "Яюк жяссъм мтпгттрт\n" +
                "Сдлзпйям йъжъ Йямъйди\n" +
                "Аяясъп адиаяй аңкттцт.\n" +
                "Аяпвям ёдпвд йякяилям\n" +
                "Ряквям адиаяй аңкттцт.\n" +
                "\n" +
                "Ьп Цтаяйсъ йопвомго,\n" +
                "Ькзйсди аңктө суиукуө,\n" +
                "Сдлзпйямгъм якгъмя\n" +
                "Яжъп ёдссз ёувупуө.\n" +
                "\n" +
                "Ясяйдрзм лтняисяс,\n" +
                "Йямъйди ртктт лтмт яисяс:\n" +
                "„Ясяйд, яёякъл ёдсрд окоиум,\n" +
                "Ялякъл ёдсрд ңчңвң,\n" +
                "Лдм азп йявъч йъкъө йопоиум.\n" +
                "Ёднгзпрдл тчтк аяясъпвя,\n" +
                "Йңпгтйст йңигңи йопорун,\n" +
                "Йякаяи аяяпън окорун.\n" +
                "Ёдндп аңкрңл ңчңмт,\n" +
                "Сзйдрзмдм рякяплъм.\n" +
                "Йяипя сяпсъө Атйяпвя,\n" +
                "Йдкадвзгди йъкяплъм.\n" +
                "Ясяйд, рдмзм чяяпънъ\n" +
                "Ьйз яикямъө тчтк гоо,\n" +
                "Йопаовугои йъкяплъм.\n" +
                "Як гя ёяквъж, лдм ёяквъж;\n" +
                "Яисякяягя рякъчъө,\n" +
                "Яюаяи йъжъй рякяиъм.\n" +
                "Цяөйямъ ёупвом ьлдмзм\n" +
                "Цяляръм ръмяө йякяиъм.\n" +
                "Йуцсуукувум азкдизм,\n" +
                "Йуцул йдкрд тчтмт,\n" +
                "Ёдпзмд цдизм рупоиум!.\n" +
                "\n" +
                "Лъмя ңчдмсзө Йямъйди\n" +
                "Йдн йоимовум чългямъө,\n" +
                "Йдкзчзлгуу сувомвуп\n" +
                "Йдпзч йзилзм сънгямъө.\n" +
                "\n" +
                "Ёңң гдвдмгд суиукуө,\n" +
                "Ьпйдйсзм йзилзм йзизмзө\n" +
                "\n" +
                "Ңкңнгңи аңквңм йяипям цяц\n" +
                "Соаово йъмяи суигу ьлз.\n" +
                "Йоөйой сдлзп йтпц аңкңс\n" +
                "Йолйопо аячйя йзигз ьлз.\n" +
                "Йяаъпвямъм рдазкгз,\n" +
                "Йзмгзйсзм оого ёявъмя\n" +
                "Йзивдм ьйдм атк адиаяй\n" +
                "Ңй осөовом сдлзпгз.\n" +
                "Сткя аңэм сңөцткяө,\n" +
                "Сңктйчтвям йяипям адс\n" +
                "Адй адйзсзө уөцукоө,\n" +
                "Яксъм ёяяй яиаякся\n" +
                "Япсъй ёяикяө азкгз ьлз\n" +
                "Йявъчйя рякцт Яй сзмсд ,\n" +
                "Яц азкдййд зкгз ьлз.\n" +
                "\n" +
                "Йңлңйңиктт ръп мяижя\n" +
                "Тцтм аңкңс ткясйям,\n" +
                "Сдлзпвд ряиря, осрум гдө,&quot;\n" +
                "Сңйсңаңи йзпзө йдсрзм гдө,!.\n" +
                "Аопу сзк йъкъө аңкңсст\n" +
                "Аовом-аосом ртткясйям,\n" +
                "Ңчңк йджгд Йямъйди\n" +
                "Опулгом цяцъ осо ькдй,\n" +
                "Ожу аякя рдйдкдй.\n" +
                "Аяръө цъйря, адиаяййя\n" +
                "Аяяпъ Атйяп сян йякъө,\n" +
                "Йңёң, лңкгң япякяч\n" +
                "зЙңйти, адиаяй, йямсдс&quot; — гдө\n" +
                "Йяпяө стпгт ёяпгямъө.\n" +
                "\n" +
                "„Ьпйдй ьлдр, йъж аңктө,\n" +
                "Ьнгзпзө здп адйдм гдө,\n" +
                "Ьөрзж аяясъп ьлдвд,\n" +
                "Ёднгзпзө здп адйдм&quot; —\n" +
                "Ётпс цңцткяө стпвямгя,\n" +
                "Йямъйдигзм яй ряпяи\n" +
                "(Йъж гя аңкрң адиаяйсъм\n" +
                "Роокосу япсъй азпгякяи!)\n" +
                "Як ряпяигъ йяпярян,\n" +
                "Ярдл лдмдм ёяикяктт,\n" +
                "Йявъч аңкрң, лзмттво\n" +
                "Йямця сткөяп аяикяктт.\n" +
                "Як сткөяпгъм зцзмгд\n" +
                "Йопвомгоп ляйсяө гян йъкяс\n" +
                "Йямъйдигзм Йяпяйячйя япвъляй;\n" +
                "Рңл стювъ цяпягяи,\n" +
                "Япс ёявъмгя рңңптрт\n" +
                "Ьпйзм ёясйям сякяягяи.\n" +
                "\n" +
                "Йдсдмцзйсдө стпаярсям,\n" +
                "Йдквдм ёңңгңм цңцтмтө,\n" +
                "Ячъө-чячъө Йямъйди,\n" +
                "Япвъляйсъ сңйтмтө,\n" +
                "Цяаңкңнтм адй сяпсъө,\n" +
                "Йтэчйямъм тжяпсъө,\n" +
                "Ёңңвң тпттцт гңаткаяр\n" +
                "(Умум тйрян, ңңкяй йяц)\n" +
                "Йяипя аяикяө йяөчъпъө,\n" +
                "Йъпяям сттвям Йямъйди\n" +
                "Йямёъвявя сяөчъпъө,\n" +
                "Йой мяижя йңкгң йңийңэө,\n" +
                "\n" +
                "Йой ёдйд* атсся цңийңэө,\n" +
                "Йяпя аңкңс йъкъцсъ\n" +
                "Ёямъмя ёякян аяикямъө,\n" +
                "Ёңкаңпрсңи адиаяй ёоморо,\n" +
                "Йяжъмякъй ряпяигям\n" +
                "„Якгял ожун ряйся—гдө,\n" +
                "Ян-сян йякгъ гякяи ёям.\n" +
                "\n" +
                "Цңн Атйяпгъм урсумго\n" +
                "Йяжъмякъй лтмяпя,\n" +
                "Атк Йямъйди цзпйзмгзм\n" +
                "Яикяръ йямця ртпяая.\n" +
                "Лтмяпямъм суаумо\n" +
                "Ряиъчйя ляигям йъкгъпвям,\n" +
                "Ёъвъкря, ётлчяй аңкңп гдө,\n" +
                "Атссяө яксъм ждп адпзө,\n" +
                "Йяпя йтлгям стмгтпвям.\n" +
                "Йяөсяө йтлгт сойсупвом,\n" +
                "Аякаямгяпвя сдөсзпвдм.\n" +
                "Ряиъч йъкцтт ляигямгя\n" +
                "Йой мяижя атквяө аяйъпъө,\n" +
                "Йямъйди стпгт ңчңмгң\n" +
                "„Ёдйдвд, адпз йдквзм!&quot;—гдө,\n" +
                "Ьп Цтаяйсъ цяйъпъө.";
        int shift = -1;
        String decryptedText = Cipher.decrypt(encryptedText, shift);
        System.out.println(decryptedText);
    }
}
